investigator/app/controllers/portfolios_controller.rb

  def index
    @portfolios = User.find(params[:user]).portfolios
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def show
    @portfolio = Portfolio.find(params[:id])
---
SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

  def destroy
    @portfolio = Portfolio.find(params[:id])
    @portfolio.delete
---
SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "portfolios" WHERE "portfolios"."id" = $1  [["id", 4]]

def create
    @portfolio = Portfolio.new(portfolio_params)
    @portfolio.save
---
INSERT INTO "portfolios" ("user_id", "ticker", "stock_name", "exchange", "purchase_price", "current_price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    # @portfolio = Portfolio.find_by ticker: params[:id]
    # @portfolio.update(portfolio_params_update)
    id = User.find_by(email: params[:user])
    @portfolio = Portfolio.find_by(ticker: params[:id], user_id: id[:id])
    puts "PORTFOLIO"
    puts @portfolio
    @portfolio.update(portfolio_params_update)
---
SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."ticker" = $1 LIMIT $2  [["ticker", "TSLA"], ["LIMIT", 1]]
UPDATE "portfolios" SET "current_price" = $1, "updated_at" = $2 WHERE "portfolios"."id" = $3  [["current_price", "90.77"], ["updated_at", "2018-04-10 02:35:54.203489"], ["id", 3]]