investigator/app/controllers/searches_controller.rb

  def search
    puts current_user
    @results = Search.all
---
SELECT "searches".* FROM "searches" WHERE (search_name LIKE '%Apple%')