investigator/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "1"], ["password_digest", "$2a$10$0EJdpcuFfNTbXLLAdYtj3.C1Dkh/QfP61pcBN1zzNieOARwkfXTpe"], ["created_at", "2018-04-12 01:05:39.086375"], ["updated_at", "2018-04-12 01:05:39.086375"]]
---
  def create
    @user = User.create(email: params[:email], password: params[:password], password_confirmation: params[:password])